test/xml/request_signed.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"><soapenv:Header><wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"><wsu:Timestamp xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:Id="TS-1DD83DB4AFA16CEF1BDB"><wsu:Created>2020-03-18T15:32:25+00:00</wsu:Created><wsu:Expires>2020-03-18T16:02:25+00:00</wsu:Expires></wsu:Timestamp><ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#"><ds:SignedInfo><ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"></ds:CanonicalizationMethod><ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"></ds:SignatureMethod><ds:Reference URI="#TS-1DD83DB4AFA16CEF1BDB"><ds:Transforms><ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"></ds:Transform></ds:Transforms><ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"></ds:DigestMethod><ds:DigestValue>aJLw+9T4tG1yLnl9otdre8Jq9jw=</ds:DigestValue></ds:Reference><ds:Reference URI="#ID-1DD83DB4AFA16CEF1BDB"><ds:Transforms><ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"></ds:Transform></ds:Transforms><ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"></ds:DigestMethod><ds:DigestValue>eWu4D+BpmZ2oXoC4Tok6vH/ysyE=</ds:DigestValue></ds:Reference></ds:SignedInfo><ds:SignatureValue>UFIE16aDgf4r4ysuVT5gE7M2Wgw49Q5O1KN7Tdh9F6pxzE1Vfx0HY7IxHgR2RRFerHwT2AeD8SdoioHaqVHR2VFw6IZWtSlNDL28a9FVdMOZiiCLxVrdMk6jYRWUpdbwTOV354E30P6V9MFrG5nQQYNp5L+qh8IfiFRMwMOTwuPTRNeMUPV98VZJ4gz4sXym/hI0WL5E+K/BGgg+nXAYXruofbdxzJbi5SSO0o/YbA8pTGFTS+h5o9YuhamQnwxah4rcD6MPwx4RaPRoXqvKRXHW7FM8qna0Bs4I4+y28Q0BdOMRt164p8A+Fo10hw2YrZR1g80UJ3vcleZjZyvg/Q==</ds:SignatureValue><ds:KeyInfo xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:Id="KI-1DD83DB4AFA16CEF1BDB"><wsse:SecurityTokenReference wsu:Id="STR-1DD83DB4AFA16CEF1BDB"><ds:X509Data><ds:X509IssuerName>CN=MPaySampleRootCA</ds:X509IssuerName><ds:X509SerialNumber>-145210810847813629119348699648824586260</ds:X509SerialNumber></ds:X509Data></wsse:SecurityTokenReference></ds:KeyInfo></ds:Signature></wsse:Security></soapenv:Header><soapenv:Body xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:Id="ID-1DD83DB4AFA16CEF1BDB"><mpay:GetOrderDetails xmlns:mpay="https://mpay.gov.md/"><mpay:query><mpay:OrderKey>3BEEA3B3-B2C3-46AC-96F4-44FC4DAA9AED</mpay:OrderKey><mpay:ServiceID>MPaySampleService</mpay:ServiceID><mpay:Language>ro</mpay:Language></mpay:query></mpay:GetOrderDetails></soapenv:Body></soapenv:Envelope>